const groups={
  group1:["روانفر پارسا", "محمد صادق فراق", "پارسا رجا", "مهدی کاویانی", "محمدعلی بندگانی", "علی کرباسی عامل", "محمد محسن مرتضوی منش", "حمیدرضا یادگار", "علی کمالی", "سید امیرعلی جعفرزاده", "محمد عرفان سعیدی", "محمد ناظر", "امیرعلی نیک آیین", "ایالفضل بلارک", "ابالفضل نصر", "محمدصدرا صالحی", "محمد پارسا شایگان", "سیدمحمد حسین دهقانی", "امیرعلی شهبازی", "مهدی مستاجران", "سیدمحمدصدرا مهاجری حجازی", "صدرا معین", "صدراً بیژنی"],
  group2:["امیرمحمد بینا", "اباالفضل رفیعیان", "سید محمد عماد زندی", "محمدصادق کدخدایی", "صالح دهکردی", "پرهام صفدریان", "محمدرضا ایزدی", "آریا رضاییان", "سیدحسین سجادی", "امیرصدرا خدابخش", "سیدعلی نیک زادالحسینی", "حسن کلانتری", "ارمیا اسماعیلی شریف", "محمدرضا صادقی", "محمدطاها محمد صادقی", "امیرعلی رضایی", "محمدصدرا خاتم سازان", "سیدمحسن قسیسین", "محمدطاها میرزا امیری", "رئوف لعلی فر", "محمدمتین توانگر فرد", "امیرحافظ جدیدی", "سجاد شریفی"],
  group3:["علی ملك پور", "علی شایسته دوست", "علیرضا رحیمی", "محمد اویسی نژاد", "محمدصدرا نقش", "امیرمحمد طاووسی", "علی امیدی", "امیرعلی حسامی زاده", "محمدمتین دادان", "محمدمهدی الهی دوست", "شایان مشفقی", "معین حلاجی", "محمدسجاد بیرایی", "امیرمحمد برزکار", "محمدامین سلیمی", "مهدی عطایی", "محمدجادی علیراده", "امیرمحمد اله دادی", "علی اصغر ابوطالبی", "علی حسین جعفری", "امیرعلی مالکی زاده"],
  group4:["امیرمحمد خانی", "حسین دایی کریم زاده", "محمد حسین احمدی", "یاسر استادان", "حافظ چیت ساز", "محمدطاها راست قلم", "محمدصالح صغیرا", "مهدی جعفری", "علی شرف الدین", "محمدمتین ازهری", "محراب استکی", "پویا یوسفیان", "محمدصدرا عزیزی پور", "علیرضا ملایی", "سیدامیرعلی محمدی", "رایان اسماعیلیان", "علیرضا حسینی", "علیرضا صیامپور", "محمدهادی ایزدی", "سیدامیرمحمد موسوی", "امیرصدرا فرهادیه", "محمدحسین شریفی", "پارسا ثنایی"],
  groupe1:["علی اله‌دادیان","علی مهدی برهانیان قناد","بهراد بهشتی","عرفان خیراللهی","علی اکبر ربیعی","امیرعلی رفیعیان","بردیا سلطانی","پویا شریف‌زاده","سید محمد فیض","محمدعلی قاسمی","امیرعلی قدسی‌فر","تمیم کربلائیان","حسین کریمی","آرمان کفایت","امین گدازنده‌ها","علی مرادی","امیرحسین مظاهری","محمدرضا زمانی"],
  groupe2:["علیرضا احمدی","مسیح تحویلیان","مهدی تدین","علی رضوانی","علی شرکت","سبحان شکریان","کیارش صمدیان","امیرعلی قجاوند","علی منعمیان","امیرعلی نیکفس","محمدجواد یزدانی","حسن یزدانی","علیرضا وجدانی","سیدمحمدمتین جعفرزاده"],
  groupe3:[
  "مهدی حیدری",
  "سیدمحمدصادق کلاهدوزان",
  "محمد امین سخاوت",
  "علی سلطانی",
  "محمد طاها شانه‌ساززاده",
  "سید امیرعلی طالقانی",
  "محمدصالح عندلیب",
  "محمد سجاد کرمانی",
  "شنتیا مطیع امراللهی",
  "محمدسام معمار",
  "امیررضا نجات‌بخش",
  "آرش هاشم‌پور",
  "شنتیا یوسفیان",
  "محمدسجاد متولی‌زاده",
  "محمدحسین طراحان",
  "علی کاظمی جزی",
  "پارسا صانعی",
],
  groupe4:["محمد آصالح", "مهدی امینی", "یوسف ترکیان", "محمدامین حسامی", "امیر حسین داوری", "محمد مهدی داوری", "محمدحسین ساعتچی", "امیرمحمد سلمانی", "امیرعباس شکری زاده", "محمد طاها صادقی", "امیرحسین صادقی", "حمید عطاریان پور", "محمد احسان فتحی", "سید امیرمهدی فتحی", "محمدحسین کشاورز", "علي اصغر کیقبادی", "سید هادی مرتضوی", "محمد مسعودی نیا", "علي ناهیدیان", "امیر حسین هنرجو"],
  groupe5:["صدرا إبراهيمي", "محمدحسين جان نثاري", "محمدطاها جعفري هرندي", "محمدحسين حاجى صالحى", "امير محمد حاجيان", "محمد حسين حيدري", "محمدامين خواجه", "ابوالفضل شاهمرادي", "حسام شريف زاده", "محمدرضا شيراني", "محمد مهدي صدري اصفهاني", "محمد صدرا صفري", "پویا طلوعى", "امير حسين علي اقاجان", "محمد امين فلاطوري", "رضا فرخ منش", "محمدسجاد فريد زاده", "حسين لاهيجانيان", "امير محمد نيري"],
  groupe6:["مهدی رضایتمند", "محمد حسین زارع", "محمدجواد صراف", "سیدرضا فتحی", "محمدصالح گرک یراقی", "محمدرضا گله دار", "سید محمد رئوف متولی امامی", "محمد جواد متولی زاده", "علیرضا محسنی", "سید محمد پویان میرحاج", "سید امیرعلی میرممتاز", "مسیح ناظری", "بهداد ولی بیک", "علی رضایی"],
};
let present={};
function openGroup(g){
  localStorage.setItem("currentGroup",g);
  window.location="group.html";
};
if
(location.pathname.includes("group.html")){
  const g=
localStorage.getItem("currentGroup");
document.getElementById("title").innerText="اعضای "+g;
  const members=groups[g];

  members.forEach(name=>present[name]=false);
  members.forEach(name=> {
    const div=document.createElement("div");
    const checkbox=document.createElement("input");
    checkbox.type="checkbox";
    const label= document.createElement("label");
    label.textContent=name;
    checkbox.addEventListener("change",()=>{present[name]=checkbox.checked;
  });
  div.appendChild(checkbox);
  div.appendChild(label);
  document.getElementById("members").appendChild(div);
  });
  window.finishAttendance=function() {
    const absent=members.filter(name=>present[name]===false);
    localStorage.setItem("absent",JSON.stringify(absent));
    window.location.href="result.html";
  }
}
if
(location.pathname.includes("result.html")){
  const list=JSON.parse(localStorage.getItem("absent")) ||[];
  const absentList=document.getElementById("absentList");
  list.forEach((n) => {
    const li=document.createElement("li");
    li.innerText=n;
    absentList.appendChild(li);
  });
}
function sendSms(){
  let phone="09130106568";
  let absents=JSON.parse(localStorage.getItem("absent"))||[];
  let text=`لیست غایبین:\n ${absents.join("\n")}`;
  let encode=encodeURIComponent(text);
  let url1=`sms:${phone}?body=${encode}`;
  let url2=`sms:${phone};?body=${encode}`;
  let url3=`sms:${phone}#Intent;scheme=sms;S.android.intent.extra.TEXT=${encode};end`;
  try {
  window.location.href=url1;
  setTimeout(()=>{
    window.location.href=url2;
  },300);
  setTimeout(()=>{
    window.location.href=url3;
  },600);
  } catch (e) {
    window.location.href=url3;
  }
}
